Switch>en
Switch#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 101
Switch(config-vlan)#vlan 102
Switch(config-vlan)#exit
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#sh vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
101  VLAN0101                         active    
102  VLAN0102                         active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
101  enet  100101     1500  -      -      -        -    -        0      0
102  enet  100102     1500  -      -      -        -    -        0      0

Switch#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range fa 0/1 - 5
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan101
                                              ^
% Invalid input detected at '^' marker.
	
Switch(config-if-range)#switchport access vlan 101
Switch(config-if-range)#int range fa 0/6 - 10
Switch(config-if-range)#switchport access vlan 102
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#exit
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show run
Building configuration...

Current configuration : 1600 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/2
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/3
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/4
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/5
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/6
 switchport access vlan 102
 switchport mode access
!
interface FastEthernet0/7
 switchport access vlan 102
 switchport mode access
!
interface FastEthernet0/8
 switchport access vlan 102
 switchport mode access
!
interface FastEthernet0/9
 switchport access vlan 102
 switchport mode access
!
interface FastEthernet0/10
 switchport access vlan 102
 switchport mode access
!

Switch#en
Switch#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int fa 0/5
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show run
Building configuration...

Current configuration : 1599 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/2
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/3
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/4
 switchport access vlan 101
 switchport mode access
!
interface FastEthernet0/5
 switchport access vlan 101
 switchport mode trunk
!
interface FastEthernet0/6
 switchport access vlan 102
 switchport mode access
!
 --More--